Revit 2015 API
CustomExporter.IncludeFaces Property
 This flag sets the exporter to either include or exclude notifications about faces being processed in the export context.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public bool IncludeFaces { get; set; }
Visual Basic
Public Property IncludeFaces As Boolean
	Get
	Set
Visual C++
public:
property bool IncludeFaces {
	bool get ();
	void set (bool value);
}
Remarks
If faces are to be excluded, the context will not receive any of the OnFaceStart and OnFaceEnd calls; however, the faces are still processes resulting in exporting their geometry as respective polymeshes.
Regardless of the value of this property, the export context must implement both OnFaceStart and OnFaceEnd methods, even though they are never called if faces are to be excluded.
Setting this property to allows clients to significantly speed up export process. If the export context does not need to examine faces, it is recommended setting this property to 'false', which will make the export process faster even when compared with export during which notifications about faces are given, but ignored.
See Also
CustomExporter Class
Autodesk.Revit.DB Namespace